/*
Написать функцию, которая принимает массив целых чисел и проверяет,
что он отсортирован по неубыванию;
*/

/*
for (то, что делаем перед первой итерацией;
    то, что проверяем перед каждой итерацией (если false - заканчиваем);
    то, что делаем в конце каждой итерации
    ) {}
*/

все хорошо, если a[i] <= a[i + 1]


bool is_sorted(int *arr, unsigned int n) {
    for (unsigned int i = 0; i < n-1; i++) {
        if (arr[i] > arr[i+1]) { 
            return false;
        }
    }
    return true;
}
